serber/air360/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_AIR360_BOARD_NAME="esp32-s3-devkitc-1"
CONFIG_AIR360_DEVICE_NAME="air360"
CONFIG_AIR360_HTTP_PORT=80
CONFIG_AIR360_I2C0_SDA_GPIO=8
CONFIG_AIR360_I2C0_SCL_GPIO=9
CONFIG_AIR360_GPS_DEFAULT_BAUD_RATE=9600
CONFIG_AIR360_WIFI_RECONNECT_BASE_DELAY_MS=10000
CONFIG_AIR360_WIFI_RECONNECT_MAX_DELAY_MS=300000
CONFIG_AIR360_WIFI_SETUP_AP_RETRY_DELAY_MS=180000
CONFIG_AIR360_WIFI_DISCONNECT_IGNORE_WINDOW_MS=2000
CONFIG_AIR360_WIFI_CONNECT_TIMEOUT_MS=15000
CONFIG_AIR360_MEASUREMENT_QUEUE_DEPTH=256
CONFIG_AIR360_BLE_PAYLOAD_REFRESH_INTERVAL_MS=5000
CONFIG_AIR360_ENABLE_LAB_AP=y
CONFIG_AIR360_LAB_AP_SSID="air360"
CONFIG_AIR360_LAB_AP_PASSWORD="air360password"
CONFIG_AIR360_LAB_AP_CHANNEL=1
CONFIG_AIR360_LAB_AP_MAX_CONNECTIONS=4
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Cellular uplink (SIM7600E) runs PPP over lwIP; the driver does not compile without it.
CONFIG_LWIP_PPP_SUPPORT=y
